INSERT INTO public.customers ( cust_surname, cust_district, cust_discount)
VALUES  ( 'Познер', 'Советский', 5),
        ( 'Малахов', 'Нижегородский', 0),
        ('Петросян', 'Приокский', 3),
        ('Левитан', 'Сормовский', 7),
        ( 'Подкаминская', 'Нижегородский', 3),
        ( 'Мартиросян', 'Ленинский', 10),
        ( 'Соловьев', 'Сормовский', 12),
        ( 'Ургант', 'Советский', 12),
        ( 'Песков', 'Канавинский', 12),
        ( 'Михеева', 'Автозаводский', 5),
        ( 'Малышева', 'Ленинский', 8),
        ( 'Пугачева', 'Московский', 14);

INSERT INTO public.shop(sh_name, sh_district, sh_commission)
VALUES
    ('Читайна', 'Автозаводский', 4),
    ('Window', 'Ленинский', 9),
    ('Мир книги', 'Канавинский', 6),
    ('Books for us', 'Московский', 5),
    ('BooKing', 'Нижегородский', 10),
    ('Дирижабль', 'Приокский', 11),
    ('Книжный дом', 'Советский', 8),
    ('Терракот', 'Сормовский', 10);


INSERT INTO public.books(book_name, book_price, book_warehouse, book_quantity)
VALUES
    ('Мастер и Маргарита', 1600, 'Автозаводский', 840),
    ('Горе от ума', 1100, 'Сормовский', 1050),
    ('Гранатовый браслет', 1400, 'Ленинский', 500),
    ('Война и мир', 5000, 'Автозаводский', 250),
    ('Записки юного врача', 740, 'Московский', 1000),
    ('Мертвые души', 500, 'Канавинский', 1800),
    ('Анна Каренина', 1200, 'Приокский', 400),
    ('Капитанская дочка', 1050, 'Канавинский', 60),
    ('Преступление и наказание', 800, 'Автозаводский', 790),
    ('Ревизор', 990, 'Советский', 800),
    ('Незнайка', 1850, 'Московский', 250);

INSERT INTO public.purchase (prch_date, sh_id, cust_id, book_id, prch_quantity, prch_amount)
VALUES  ('2022-01-02', 3, 5, 7, 1, 180),
        ('2021-12-29', 8, 1, 4, 2, 300),
        ('2022-01-15', 2, 5, 6, 1, 200),
        ('2022-02-22', 5, 1, 8, 3, 660),
        ('2022-06-08', 2, 2, 7, 1, 180),
        ('2020-11-13', 3, 3, 9, 4, 400),
        ('2021-08-26', 8, 7, 10, 1, 230),
        ('2021-04-11', 6, 4, 3, 3, 1650),
        ('2022-03-01', 1, 9, 3, 1, 550),
        ('2020-09-23', 4, 12, 5, 1, 380),
        ('2019-10-02', 7, 11, 1, 1, 250),
        ('2020-03-15', 7, 11, 7, 2, 360),
        ('2009-01-10', 1, 3, 6, 10, 2000),
        ('2002-03-23', 2, 1, 8, 30, 6600),
        ('2012-05-02', 2, 2, 7, 1, 180),
        ('2022-03-15', 8, 5, 9, 12, 1200),
        ('2021-11-27', 3, 7, 10, 1, 230),
        ('2021-09-19', 7, 7, 3, 3, 1650),
        ('2022-03-13', 4, 8, 3, 10, 5500),
        ('2022-04-02', 7, 2, 5, 1, 380),
        ('2019-05-12', 6, 12, 1, 10, 2500),
        ('2020-07-25', 5, 11, 7, 2, 360),
        ('2022-05-20', 6, 12, 6, 1, 200),
        ('2021-03-13', 5, 2, 8, 3, 660),
        ('2019-01-22', 2, 4, 7, 10, 1800),
        ('2022-01-05', 3, 11, 9, 12, 1200),
        ('2021-12-07', 1, 5, 10, 10, 2300),
        ('2021-10-29', 4, 12, 3, 10, 5500),
        ('2022-05-03', 7, 6, 3, 1, 550),
        ('2019-07-22', 4, 3, 5, 10, 3800),
        ('2019-12-02', 2, 5, 1, 1, 250),
        ('2022-02-15', 4, 1, 7, 20, 3600);